app/controllers/api/v1/auth_controller.rb

SELECT "users".* FROM "users" WHERE "users"."username" = $1 LIMIT $2  [["username", "adsf"], ["LIMIT", 1]]
---
    def login
      user = User.find_by(username: params[:username])