app/controllers/api/v1/users_controller.rb

    def create
        user = User.find_or_create_by(username: params[:username], password: params[:password])
---
SELECT "users".* FROM "users" WHERE "users"."username" = $1 AND "users"."password" = $2 LIMIT $3  [["username", ""], ["password", ""], ["LIMIT", 1]]
INSERT INTO "users" ("fname", "lname", "phonenumber", "username", "password_digest", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"